import random
import re

emoji_responses = {
    # دسته‌های احساسی و مذهبی
    "احساسات مذهبی": {
        "emojis": ["🕌", "📿", "☪️", "🌙", "🙏", "💫", "🕋", "🌌"],
        "responses": [
            "ایمان و محبت همیشه همراهت باشه 🕌",
            "باور و ایمان راه به سمت آرامشه 📿",
            "دعا و نیایش تو همیشه مستجاب بشه 🌙",
            "خدا همیشه پشت و پناهت 🙏",
            "ایمان باعث آرامش و صبر میشه 💫",
            "کعبه دل‌ها همیشه روشنت باشه 🕋",
            "خدایا ما را در مسیر حق یاری کن 🌌"
        ]
    },
    "مودبانه": {
        "emojis": ["🙏", "😊", "🙇", "🌹", "💐", "✨", "🤲", "🖤"],
        "responses": [
            "از ادب و احترام تو سپاسگزارم 🌹",
            "احترام همیشه با ارزش‌ترین چیزه 🙏",
            "شما با احترام و ادب خودتونو نشون می‌دین 😊",
            "با ادب و احترام دنیای بهتری می‌سازیم 💐",
            "این همه احترام و فروتنی تو تحسین برانگیزه ✨",
            "بزرگی و احترام دل‌ها رو نزدیک‌تر می‌کنه 🤲",
            "فروتنی تو بی‌نهایت ارزشمنده 🖤"
        ]
    },

    # پرچم‌های کشورهای دوست و دشمن
    "پرچم‌ها": {
        "emojis": ["🇮🇷", "🇮🇶", "🇾🇪", "🇱🇧", "🇵🇸", "🇺🇸", "🇮🇱", "🇬🇧", "🇸🇾"],
        "responses": {
            "🇮🇷": ["ایران عزیز، سرافراز و مقتدر! 🇮🇷"],
            "🇮🇶": ["عراق، همسایه محترم و هم‌پیمان عزیز ما 🇮🇶"],
            "🇾🇪": ["یمن، نماد مقاومت و پایداری! 🇾🇪"],
            "🇱🇧": ["لبنان، دوست و برادر عزیز ملت ایران 🇱🇧"],
            "🇵🇸": ["فلسطین، سرزمین مقاومت و ایستادگی 🇵🇸"],
            "🇸🇾": ["سوریه، کشوری متحد و مقاوم 🇸🇾"],
            "🇮🇱": ["چنین کشوری نمی‌شناسم؛ دشمن قسم خورده ماست."],
            "🇺🇸": ["این پرچم برای کشور شیطان بزرگ است و یادآور ظلم و بی‌عدالتی! 🇺🇸"],
            "🇬🇧": ["این پرچم، نماد حیله‌گری و نیرنگ دنیاست! 🇬🇧"]
        }
    },

    # دیگر احساسات اضافه‌شده
    "شوخ‌طبعی": {
        "emojis": ["😜", "😝", "😛", "🤣", "😹", "😂", "🤪", "🙃"],
        "responses": [
            "تو هم خیلی باحالی! 😜",
            "این شوخی جالب بود! 😂",
            "با این شوخ‌طبعی‌ات حسابی خندیدم! 😹",
            "بامزه بود! همیشه شاد و خنده‌رو باشی 😊",
            "شوخی‌های تو حسابی منو خندوند 😝",
            "خنده‌هات همیشه به دل می‌شینه 🤪",
            "خنده‌هامون پایدار! 🙃"
        ]
    },
    "افکار مثبت": {
        "emojis": ["🌸", "✨", "🌟", "🌞", "🌈", "🍀", "☀️", "🌻"],
        "responses": [
            "این انرژی مثبتت رو همیشه حفظ کن! 🌞",
            "با افکار مثبتت دنیا رو زیباتر می‌کنی ✨",
            "امیدوارم همیشه این انرژی خوبت پایدار باشه 🌈",
            "با همین حس مثبت ادامه بده، موفقیت نزدیکی 🌸",
            "دنیات پر از نور و شادی باشه! 🌟",
            "پایدار بمون و رشد کن! 🍀",
            "خوشی و شکوفایی برات در پیشه ☀️"
        ]
    },
    "افتخار": {
        "emojis": ["💪", "🏆", "🥇", "🎖️", "🔥", "🎉", "💥"],
        "responses": [
            "همیشه قوی و پرقدرت باقی بمون! 💪",
            "به این افتخار و اقتدار باید ببالیم! 🏆",
            "افتخار به کشور و فرهنگمون، افتخار به زندگیه 🎖️",
            "باعث افتخار و مباهات همه مایی! 🥇",
            "این قدرت و افتخار بی‌نظیره! همیشه پایدار باش 🔥",
            "افتخار بزرگی در کارنامه تو ثبت شد 🎉",
            "با این قدرت، موفقیت و پیشرفت همواره از آن توست 💥"
        ]
    },
    "بخشش و مهربانی": {
        "emojis": ["🤲", "💞", "❤️", "🤍", "🕊️", "🌹", "🌸"],
        "responses": [
            "بخشش و مهربانی نشانه بزرگیه ❤️",
            "بهترینی که با مهربانی و عشق زندگی می‌کنی 💞",
            "مهربانی تو به دل همه نشسته 🤍",
            "خداوند بهت سلامتی و عشق بده 🕊️",
            "بخشندگی نشانه بزرگی روح توست ❤️",
            "عشق و مهربانی، ریشه در دل تو داره 🌹",
            "تو نماد صلح و دوستی هستی 🌸"
        ]
        
        
    },
    "ورزش و تناسب‌اندام": {
        "emojis": ["🏃", "🏋️", "⛹️", "🚴", "🤸", "⚽", "🏀", "🏆", "🥇"],
        "responses": [
            "همیشه فعال و پرانرژی بمون 🏃",
            "تناسب و سلامتی، رمز شادکامی است! 🏋️",
            "قهرمانی و افتخار همیشه در کنارته 🏆"
        ]
    },
     # دسته محیط‌زیست و طبیعت
    "محیط‌زیست و طبیعت": {
        "emojis": ["🌍", "🌲", "🌳", "🌊", "🌞", "🌈", "🌱", "🌸"],
        "responses": [
            "طبیعت خانه ماست، باید ازش مراقبت کنیم 🌍",
            "سبزی و طراوت طبیعت همیشه زیباس 🌲",
            "زمین رو دوست بدار و ازش محافظت کن 🌍"
        ]
    },
    
      # دسته غذا
    "غذا": {
        "emojis": ["🍕", "🍔", "🍟", "🍣", "🍜", "🍰", "🍪", "🍿", "🍩", "🍫"],
        "responses": [
            "غذاهای خوشمزه همیشه خوشحالی به‌همراه دارند! 🍕",
            "هیچ چیز به اندازه یک غذای خوب شاداب‌کننده نیست! 🍔",
            "نوش جان! امیدوارم غذات خوشمزه باشه 🍜"
        ]
    },
    
    "حیوانات": {
        "emojis": ["🐱", "🐶", "🐰", "🦁", "🐼", "🐨", "🐤", "🐸", "🐢", "🐠"],
        "responses": [
            "این حیوانات خیلی دوست‌داشتنی و بامزه‌اند! 🐱",
            "زیبایی طبیعت در هر حیوانی پیدا میشه 🐰",
            "قدرت و شکوه در حیوانات هم دیده میشه 🦁"
        ]
    },
    
    
    
    
    
   
    
    
  
    
    
}

# تابع برای پردازش و یافتن ایموجی با استفاده از الگوی `re`
def find_emoji_response(text):
    for emotion, data in emoji_responses.items():
        emojis = data["emojis"]
        if emotion == "پرچم‌ها":
            for flag, response_list in data["responses"].items():
                if flag in text:
                    return random.choice(response_list)
        else:
            pattern = "|".join(re.escape(emoji) for emoji in emojis)  # ایجاد الگوی `re` برای تطبیق ایموجی‌ها
            if re.search(pattern, text):  # جستجوی الگو در متن
                return random.choice(data["responses"])
    return None  # اگر هیچ ایموجی پیدا نشد، None برگردان






# predictions.py

predictions = {
   "روزانه": [
    "امروز روز خوبی برای شروع پروژه‌های جدید است.",
    "شما امروز با یک فرصت شگفت‌انگیز روبرو خواهید شد.",
    "امروز احتمالاً یک تغییر مثبت در زندگی شما اتفاق خواهد افتاد.",
    "امروز روزی است که باید با دقت بیشتری تصمیمات بگیرید.",
    "یک اتفاق خوشایند در این روز شما را شگفت‌زده خواهد کرد.",
    "امروز انرژی شما بیشتر است، از آن برای انجام کارهای مهم استفاده کنید.",
    "شاید امروز نیاز داشته باشید کمی استراحت کنید و انرژی بگیرید.",
    "روزتان با انرژی خوبی شروع خواهد شد، به خودتان اعتماد کنید.",
    "امروز فرصت خوبی برای ارتباط بیشتر با دوستان و آشنایان است.",
    "اگر ایده‌ای جدید دارید، امروز زمان مناسبی برای اجرای آن است.",
    "امروز روز مناسبی برای حل مسائل و چالش‌ها است.",
    "خودتان را به چالش بکشید، نتایج خوبی خواهید دید.",
    "کمی آرامش را به زندگی‌تان اضافه کنید، به شما کمک خواهد کرد.",
    "امروز ممکن است با یک تصمیم مهم روبرو شوید، به قلبتان گوش کنید.",
    "این روز برای شروع فعالیت‌های ورزشی جدید مناسب است.",
    "بگذارید تغییرات به‌طور طبیعی اتفاق بیافتند.",
    "به افکار منفی فکر نکنید، امروز بهترین زمان برای رها کردن آن‌هاست.",
    "امروز با افراد زیادی در تعامل خواهید بود، سعی کنید انعطاف‌پذیر باشید.",
    "مراقب سلامت جسمی‌تان باشید، بدن شما امروز به توجه نیاز دارد.",
    "یک فرصت آموزشی ممکن است پیش بیاید، آن را غنیمت بشمارید.",
    "زمانی برای استراحت و بازگشت به خودتان پیدا کنید.",
    "به احساساتتان توجه کنید، امروز ممکن است عمیق‌تر شوند.",
    "امروز با مسائل جدیدی روبرو خواهید شد، به آن‌ها با دید مثبت نگاه کنید.",
    "شاید امروز از یک دوست خبری بگیرید که مدت‌ها ندیده‌اید.",
    "روزتان با یک حس خوب آغاز خواهد شد، سعی کنید آن را حفظ کنید.",
    "امروز درک بیشتری از اطرافیان پیدا خواهید کرد.",
    "امروز ممکن است با چالش‌هایی در محیط کار روبرو شوید.",
    "امروز روزی است که به خودتان و توانایی‌هایتان ایمان داشته باشید.",
    "به جزئیات توجه کنید، آن‌ها امروز اهمیت ویژه‌ای دارند.",
    "یک مکالمه مهم ممکن است امروز زندگی‌تان را تغییر دهد.",
    "احساس آزادی بیشتری خواهید داشت، به دنبال خلاقیت بروید.",
    "امروز سعی کنید با دیگران مهربان‌تر برخورد کنید.",
    "به روحیه خودتان توجه کنید و از آن مراقبت کنید.",
    "امروز ممکن است چیزی جدید یاد بگیرید، پذیرای آن باشید.",
    "این روز برای برنامه‌ریزی‌های بلندمدت مناسب است.",
    "امروز با دقت به احساسات دیگران گوش کنید.",
    "سعی کنید از امروز لذت ببرید و نگرانی‌ها را رها کنید.",
    "روزتان با لحظات خوبی همراه خواهد بود، از آن‌ها قدردانی کنید.",
    "امروز فرصت خوبی برای بازنگری در اهداف‌تان است.",
    "به خودتان زمان بدهید تا با تغییرات جدید سازگار شوید.",
    "خودتان را در موقعیت‌های جدید امتحان کنید، ممکن است شگفت‌زده شوید.",
    "امروز به دستاوردهای قبلی‌تان فکر کنید و از آن‌ها انگیزه بگیرید.",
    "به دیگران کمک کنید، این کار احساس خوبی به شما خواهد داد.",
    "امروز ممکن است با شخصی روبرو شوید که مسیر زندگی شما را تغییر دهد.",
    "از خلاقیت خودتان بهره بگیرید، ممکن است نتایج خوبی داشته باشد.",
    "این روز برای کشف علاقه‌های جدید مناسب است.",
    "به فکر بهبود کیفیت زندگی‌تان باشید.",
    "امروز سعی کنید از طبیعت و زیبایی‌های اطراف لذت ببرید.",
    "ممکن است احساس خوشحالی و آرامش بیشتری داشته باشید.",
    "یک فرصت برای ارتباط با عزیزان‌تان ایجاد خواهد شد، از آن استفاده کنید.",
    "امروز روزی است که می‌توانید کارهای ناتمام را به اتمام برسانید."
],

    "احساسی": [
    "امروز شما ممکن است احساساتتان کمی پیچیده باشند.",
    "احساس درونی شما امروز بسیار قوی است، سعی کنید به آن اعتماد کنید.",
    "شما امروز ممکن است با چالش‌های عاطفی روبرو شوید، اما از آن عبور خواهید کرد.",
    "احساسات شما امروز در تعادل خواهند بود، اما مراقب افکار منفی باشید.",
    "امروز ممکن است احساس بی‌قراری کنید، اما این احساس موقتی است.",
    "احساس نزدیکی بیشتری به اطرافیان خود دارید، از این فرصت استفاده کنید.",
    "امروز روزی است که نیاز به توجه بیشتری به خود دارید.",
    "به احساساتتان توجه کنید و بگذارید به شما راهنمایی کنند.",
    "کمی به خودتان فرصت دهید تا احساسات‌تان را بهتر درک کنید.",
    "اگر با دیگران مشکلی دارید، امروز زمان مناسبی برای صحبت کردن است.",
    "احساسات درونی شما امروز شفاف‌تر خواهند بود.",
    "ممکن است امروز با شخصی روبرو شوید که احساسات شما را برانگیزد.",
    "بگذارید احساسات‌تان امروز آزادانه جریان داشته باشند.",
    "با دقت به احساسات‌تان توجه کنید و از آن‌ها یاد بگیرید.",
    "شاید امروز دچار احساس تنهایی شوید، اما زودگذر است.",
    "به خودتان اجازه دهید که امروز مهربان‌تر باشید.",
    "امروز به دنبال شناخت بیشتری از احساسات‌تان باشید.",
    "یک مکالمه عمیق می‌تواند احساسات شما را تغییر دهد.",
    "از درون خودتان قدرت بگیرید و به خودتان اعتماد کنید.",
    "امروز ممکن است به کسی نیاز داشته باشید که به شما گوش دهد.",
    "به حس آرامش توجه کنید و آن را تقویت کنید.",
    "از احساسات مثبت خود بهره ببرید تا روزتان بهتر شود.",
    "امروز ممکن است احساس عشق بیشتری در خود حس کنید.",
    "بگذارید احساسات منفی رها شوند و شما آزاد شوید.",
    "به خودتان و احساسات‌تان افتخار کنید.",
    "احساسات‌تان را امروز با کسانی که دوست دارید به اشتراک بگذارید.",
    "امروز به دنبال آرامش درونی باشید.",
    "احساسات خود را بدون ترس بیان کنید.",
    "امروز فرصت خوبی برای شناخت بیشتر از خودتان است.",
    "به دیگران اجازه دهید که در زندگی شما جایگاهی پیدا کنند.",
    "امروز ممکن است حس قدردانی بیشتری داشته باشید.",
    "کمی به خودتان استراحت بدهید و آرامش بگیرید.",
    "اجازه دهید احساسات شما را راهنمایی کنند.",
    "با دیگران صمیمی‌تر باشید و احساسات‌تان را ابراز کنید.",
    "امروز ممکن است نیاز داشته باشید کمی با خودتان خلوت کنید.",
    "به حس خوشحالی و عشق توجه کنید و آن را تقویت کنید.",
    "اگر به احساسات‌تان اجازه دهید جریان یابند، آرامش بیشتری خواهید داشت.",
    "امروز روزی است که به خودتان بیشتر عشق بورزید.",
    "از احساسات مثبت و خوشایند خود بهره ببرید.",
    "ممکن است حس عشق و دوستی قوی‌تری را تجربه کنید.",
    "امروز به حس خلاقیت و شادی‌تان توجه کنید.",
    "از چیزهای کوچک لذت ببرید و احساسات مثبت داشته باشید.",
    "امروز روزی است که احساسات خودتان را با دقت بیشتری بشناسید.",
    "احساسات خود را امروز آزاد کنید و به خودتان فرصت دهید.",
    "ممکن است حس اشتیاق بیشتری برای زندگی داشته باشید.",
    "امروز روز خوبی برای شروع یک سفر احساسی است.",
    "به دیگران عشق و محبت بیشتری نشان دهید.",
    "احساسات شما امروز می‌تواند الهام‌بخش اطرافیان باشد.",
    "از احساسات خود برای ایجاد تغییرات مثبت در زندگی بهره ببرید.",
    "احساسات‌تان را با انرژی مثبت تقویت کنید و از آن‌ها لذت ببرید."
],

    "مالی": [
    "شما در زمینه مالی به زودی تغییراتی مثبت مشاهده خواهید کرد.",
    "امروز ممکن است شما با چالش‌هایی در مسائل مالی روبرو شوید.",
    "ممکن است امروز یک فرصت مالی جدید برای شما پیش آید.",
    "در این روز، بهتر است مراقب خرج‌های بی‌مورد باشید.",
    "در مسائل مالی صبور باشید، به زودی وضع شما بهبود خواهد یافت.",
    "یک تصمیم هوشمندانه مالی می‌تواند آینده مالی شما را بهتر کند.",
    "پیشرفت‌های مالی شما نزدیک است، به برنامه‌هایتان پایبند بمانید.",
    "ممکن است امروز یک پاداش مالی کوچک دریافت کنید.",
    "به دنبال سرمایه‌گذاری‌های مطمئن باشید، فرصت خوبی است.",
    "هزینه‌های غیرضروری را کنترل کنید، به شما کمک خواهد کرد.",
    "این روزها زمان خوبی برای مشورت مالی با یک متخصص است.",
    "به فکر پس‌انداز بیشتر باشید، این اقدام به نفع شما خواهد بود.",
    "ممکن است یک منبع درآمد جدید پیدا کنید.",
    "بودجه خود را بررسی کنید و بهینه‌سازی کنید.",
    "امروز زمان خوبی برای خرید نیست، صبر کنید.",
    "برای موفقیت مالی، اهداف خود را مشخص کنید.",
    "از معاملات پرریسک اجتناب کنید، ممکن است نتیجه مطلوب ندهند.",
    "پیش‌بینی مالی شما در حال بهتر شدن است.",
    "در مورد برنامه‌های مالی بلندمدت خود تأمل کنید.",
    "به دارایی‌های فعلی‌تان توجه بیشتری داشته باشید.",
    "ممکن است امروز مبلغی به شما بازگردد که انتظارش را نداشتید.",
    "در تصمیمات مالی خود محتاط باشید.",
    "به فکر کسب درآمد از علاقه‌های خود باشید.",
    "اگر برنامه‌ریزی مالی دقیق‌تری داشته باشید، موفق‌تر خواهید بود.",
    "روز خوبی برای ارزیابی مالیات‌های خود است.",
    "ممکن است امروز هزینه‌ای پیش‌بینی نشده داشته باشید.",
    "پس‌انداز بیشتری داشته باشید تا از چالش‌های مالی جلوگیری کنید.",
    "بودجه خود را با دقت بیشتری تنظیم کنید.",
    "سرمایه‌گذاری‌هایتان را بازبینی کنید و تصمیمات بهتری بگیرید.",
    "ممکن است یک فرصت شغلی جدید با درآمد بهتر به شما پیشنهاد شود.",
    "اگرچه روزهای سختی در پیش است، اما آرام باشید و تمرکز کنید.",
    "به فکر سرمایه‌گذاری در تحصیلات و یادگیری باشید.",
    "این هفته برای خریدهای بزرگ زمان مناسبی نیست.",
    "به فکر ایده‌های کسب و کار جدید باشید.",
    "یک تغییر مثبت مالی در روزهای آینده پیش‌بینی می‌شود.",
    "به دنبال روش‌های کسب درآمد جدید باشید.",
    "پس‌انداز کنید و برای آینده‌ای امن برنامه‌ریزی کنید.",
    "امروز زمان خوبی برای ارزیابی بیمه‌های خود است.",
    "خودتان را به چالش بکشید تا از بدهی‌هایتان خلاص شوید.",
    "به فکر بهبود شرایط مالی خود از طریق صرفه‌جویی باشید.",
    "سرمایه‌گذاری‌های کوچک ولی مطمئن را در نظر بگیرید.",
    "مراقب پیشنهادات مالی غیرمعمول باشید.",
    "به فکر کمک به دیگران باشید، بازتاب مالی خوبی خواهد داشت.",
    "ممکن است امروز با یک فرصت شغلی مالی مواجه شوید.",
    "امروز روز خوبی برای بررسی حساب‌های خود است.",
    "در مورد وام‌های جدید با دقت بیشتری تصمیم بگیرید.",
    "بودجه خانوادگی خود را بازبینی و بهینه کنید.",
    "خودتان را با سرمایه‌گذاری‌های کوتاه‌مدت محدود نکنید.",
    "به دنبال فرصت‌های تجاری جدید باشید، سودآور خواهد بود.",
    "امروز روز مناسبی برای درخواست افزایش حقوق است."
],

    "اجتماعی": [
    "امروز فرصتی برای ملاقات با افراد جدید خواهید داشت.",
    "در روابط اجتماعی شما، روزی خوب و پر از گفتگوهای مهم خواهید داشت.",
    "ممکن است امروز با فردی آشنا شوید که تأثیر زیادی در زندگی شما بگذارد.",
    "در تعاملات اجتماعی‌تان، به خودتان اعتماد کنید و از نظرات دیگران بهره ببرید.",
    "یک تغییر اجتماعی مثبت در روزهای آینده برای شما در راه است.",
    "امروز بیشتر از همیشه با دوستان خود وقت بگذرانید.",
    "ممکن است امروز در جمعی مورد احترام قرار بگیرید.",
    "افراد جدیدی به زندگی اجتماعی‌تان اضافه خواهند شد.",
    "یک دوست قدیمی ممکن است با شما تماس بگیرد.",
    "روابط اجتماعی‌تان امروز می‌تواند شادی‌آور باشد.",
    "ممکن است در رویدادی شرکت کنید که دوستان جدیدی پیدا کنید.",
    "امروز با خانواده و دوستانتان وقت بگذرانید، لذت‌بخش خواهد بود.",
    "فرصت‌های جدیدی در جامعه برای شما ایجاد خواهد شد.",
    "ممکن است امروز در یک بحث یا گفتگو شرکت کنید.",
    "با افرادی که هم‌فکر شما هستند، ارتباط برقرار کنید.",
    "امروز زمان خوبی برای کمک به دیگران است.",
    "از فرصت‌های اجتماعی که امروز پیش می‌آید استفاده کنید.",
    "در جامعه به دیگران احترام بگذارید و احترام خواهید گرفت.",
    "یک دعوت غیرمنتظره برای شرکت در یک رویداد خواهید داشت.",
    "ممکن است با شخصی روبرو شوید که به شما کمک بزرگی کند.",
    "به خانواده و دوستانتان بیشتر توجه کنید.",
    "امروز فرصتی برای تقویت روابط دوستانه خواهد داشت.",
    "روابط شما با افراد خانواده محکم‌تر خواهد شد.",
    "ممکن است امشب در یک رویداد یا دورهمی شرکت کنید.",
    "امروز ممکن است درک عمیق‌تری از احساسات دیگران داشته باشید.",
    "یک فرصت جدید برای برقراری رابطه دوستانه به شما داده خواهد شد.",
    "از تعاملات جدید خود تجربه بگیرید و رشد کنید.",
    "اگر با کسی دلخوری دارید، امروز روز خوبی برای حل آن است.",
    "روابط اجتماعی‌تان امروز می‌تواند زمینه‌ساز اتفاقات خوبی شود.",
    "امروز ممکن است از طرف یک دوست قدردانی بشوید.",
    "ممکن است در یک فعالیت گروهی شرکت کنید.",
    "به دنبال ایجاد روابط جدید و مفید باشید.",
    "دوستان جدید می‌توانند افق‌های تازه‌ای برای شما باز کنند.",
    "بیشتر با دوستانتان صحبت کنید و از آن‌ها انرژی بگیرید.",
    "امروز روز خوبی برای ملاقات با افراد جدید است.",
    "ممکن است با کسی آشنا شوید که الهام‌بخش شما باشد.",
    "با دیگران با احترام و ادب برخورد کنید و به شما احترام خواهند گذاشت.",
    "به جمع‌ها و دورهمی‌ها دعوت خواهید شد.",
    "فرصتی برای بهبود روابط اجتماعی خود خواهید داشت.",
    "ممکن است در جمعی برجسته و مورد توجه قرار بگیرید.",
    "فرصت خوبی برای بازدید از دوستان و آشنایان پیش خواهد آمد.",
    "در یک مکالمه یا بحث دوستانه شرکت کنید و از آن لذت ببرید.",
    "اگر دلخوری با کسی دارید، امروز فرصت خوبی برای رفع آن است.",
    "تلاش کنید روابط جدیدی ایجاد کنید.",
    "امروز ممکن است یک رابطه دوستانه جدید شکل بگیرد.",
    "از حمایت‌های اجتماعی خود قدردانی کنید.",
    "در جمع‌ها اعتماد به نفس بیشتری داشته باشید.",
    "امروز ممکن است روزی پربار از لحاظ ارتباطات اجتماعی باشد.",
    "فرصت‌های جدید اجتماعی به شما پیشنهاد خواهد شد."
],

    "خانوادگی": [
    "امروز روزی خوب برای ارتباط بیشتر با اعضای خانواده است.",
    "ممکن است در روابط خانوادگی‌تان تحولی مثبت ایجاد شود.",
    "ممکن است با یک نفر از اعضای خانواده به یک تفاهم جدید برسید.",
    "به‌زودی یک رویداد خانوادگی خوشایند شما را شاد خواهد کرد.",
    "در روابط خانوادگی، بهتر است بیشتر از همیشه به احساسات دیگران توجه کنید.",
    "شاید امروز وقت بیشتری با خانواده بگذرانید.",
    "ممکن است امروز به یک جشن خانوادگی دعوت شوید.",
    "فرصتی برای حل مشکلات خانوادگی خواهید داشت.",
    "امروز می‌توانید با خانواده‌تان روابط عمیق‌تری برقرار کنید.",
    "اگر مشکلی با اعضای خانواده دارید، امروز روز خوبی برای حل آن است.",
    "روابط خانوادگی شما امروز بیشتر از همیشه مستحکم خواهد شد.",
    "به اعضای خانواده‌تان محبت کنید و آن‌ها به شما محبت خواهند داشت.",
    "امروز برای گفت‌وگوهای خانوادگی زمان بگذارید.",
    "خانواده شما نیاز به حمایت و حضور شما دارد.",
    "ممکن است یک خبر خوب خانوادگی دریافت کنید.",
    "امروز می‌توانید از وقت گذراندن با خانواده لذت ببرید.",
    "امروز فرصتی برای جشن گرفتن با خانواده خواهید داشت.",
    "به عزیزانتان نشان دهید که برایتان مهم هستند.",
    "اگر مسئله‌ای در خانواده دارید، امروز به آرامی حلش کنید.",
    "فرصتی برای بازسازی روابط خانوادگی پیش خواهد آمد.",
    "ممکن است با یکی از اعضای خانواده به سفر بروید.",
    "از بودن در کنار خانواده لذت ببرید.",
    "امروز ممکن است خبر خوشایندی از خانواده دریافت کنید.",
    "به صحبت‌های خانواده گوش دهید، امروز اهمیت دارند.",
    "محبتتان به خانواده امروز بیشتر از همیشه خواهد بود.",
    "اگر اختلافی با خانواده دارید، امروز فرصت خوبی برای حل آن است.",
    "امروز روزی عالی برای گذراندن وقت با عزیزان است.",
    "فرصت خوبی برای بازسازی روابط خانوادگی خواهید داشت.",
    "روابطتان با اعضای خانواده بهبود می‌یابد.",
    "در کنار خانواده حس امنیت و آرامش را تجربه خواهید کرد.",
    "امروز ممکن است یک موضوع خانوادگی مهم به شما واگذار شود.",
    "در خانه با عشق و احترام با خانواده رفتار کنید.",
    "لحظاتی خوشایند با خانواده خود داشته باشید.",
    "به خانواده خود نشان دهید که برایتان مهم هستند.",
    "به افکار و احساسات عزیزانتان بیشتر توجه کنید.",
    "روابط شما با خانواده امروز گرم‌تر از همیشه خواهد بود.",
    "از انرژی مثبت خانواده بهره بگیرید.",
    "ممکن است امروز در خانه لحظات خاطره‌انگیزی داشته باشید.",
    "به پدر و مادرتان نزدیک‌تر شوید و به آن‌ها احترام بگذارید.",
    "در کنار خانواده حس راحتی بیشتری خواهید داشت.",
    "امروز برای رسیدن به تفاهم بهتر با خانواده فرصت خوبی است.",
    "محبت خود را به اعضای خانواده نشان دهید.",
    "از حمایت‌های خانواده خود قدردانی کنید.",
    "خانواده‌تان نیاز به توجه بیشتری دارند، امروز زمان آن است.",
    "از لحظات کنار خانواده لذت ببرید و قدردان باشید.",
    "امروز ممکن است یک مراسم خانوادگی شما را شاد کند.",
    "فرصت خوبی برای تجدید پیوندهای خانوادگی خواهید داشت.",
    "ممکن است در خانواده به یک توافق برسید.",
    "از بودن در کنار خانواده آرامش بگیرید."
],
    
    "ترس‌آمیز": [
    "ممکن است در ۳ روز آینده به شدت خسته شوید؛ شاید وقت آن باشد که استراحت کنید!",
    "پیش‌بینی‌ها نشان می‌دهد که در ۷ روز آینده شاید از شدت خستگی، یک روز کامل بخوابید!",
    "ممکن است در ۲ ماه آینده نیاز به تغییرات بزرگی در زندگی داشته باشید؛ آماده‌اید؟",
    "در ۴۵ روز آینده، چالش بزرگی سر راهتان خواهد بود. آرامش خود را حفظ کنید!",
    "تا ۵۰ روز دیگر احتمالاً نیاز به استراحت و بازنگری دارید؛ اما نگران نباشید!",
    "در سال آینده با لحظاتی مواجه می‌شوید که شاید دلتان بخواهد بخوابید و همه چیز را فراموش کنید!",
    "۳ روز آینده را آماده باشید، زیرا ممکن است حوصله‌تان به شدت سر برود!",
    "پیش‌بینی‌ها نشان می‌دهد که در ماه آینده احتمالاً یک روز کامل خسته خواهید بود!",
    "به نظر می‌رسد که تا ۹۰ روز آینده روزهای چالشی زیادی در راه است؛ اما جای نگرانی نیست!",
    "در ۱۵ روز آینده شاید بخواهید از جمع‌ها دوری کنید و به تنهایی استراحت کنید!",
    "پیش‌بینی می‌شود که در ۶ ماه آینده به شدت به آرامش نیاز پیدا کنید!",
    "در ۳۰ روز آینده اتفاقات عجیبی پیش‌بینی می‌شود. شاید وقت آن باشد که کمی استراحت کنید!",
    "در دو هفته آینده ممکن است با مسائلی روبه‌رو شوید که شما را کاملاً از پا در بیاورد!",
    "ظاهراً در ۴۵ روز آینده نیاز دارید که روزهایی کاملاً به خودتان اختصاص دهید!",
    "در سال آینده شاید چالش‌هایی باعث شود از همه چیز خسته شوید، ولی خوش بگذرانید!",
    "در ۷۵ روز آینده شاید به یک سفر طولانی نیاز پیدا کنید تا استراحت کنید.",
    "در ۶ ماه آینده احتمالاً بخواهید کاملاً همه چیز را رها کنید و کمی به خودتان برسید!",
    "طالع شما نشان می‌دهد که در ۳ ماه آینده نیاز به آرامش و خلوت دارید!",
    "تا ۹۰ روز دیگر شاید بخواهید خود را از روزمرگی‌ها خلاص کنید و به طبیعت بروید.",
    "پیش‌بینی می‌شود که در سال آینده احتمالاً خواب‌های عجیبی ببینید که شما را کنجکاو کند!",
     "پیش‌بینی می‌شود که در ۳ روز آینده یک اتفاق غیرمنتظره شما را غافلگیر کند... آماده باشید!",
    "در ۴۲ روز آینده، شاید با چیزی روبرو شوید که بهتر است به آن فکر نکنید... تا آن زمان از هر لحظه لذت ببرید!",
    "طالع شما نشان می‌دهد که در ۷۲ ساعت آینده مراقب اطرافتان باشید؛ شاید چیزی عجیب در انتظار شما باشد.",
    "تا ۱۳ روز دیگر، ممکن است در یک شب عجیب و به یادماندنی با چیزی مرموز روبرو شوید. جرأت دارید؟",
    "پیش‌بینی می‌شود که تا پایان این ماه، یک حس سرد و مرموز شما را در بر گیرد... شاید زمان آن رسیده که کمی محتاط‌تر باشید.",
    
]

    
    

}


haqiqat = [
    "چند نفر از دوستانت رو در گوشی‌ات ذخیره کردی؟",
    "آیا تا به حال کسی رو فریب دادی؟",
    "آخرین بار که گریه کردی کی بود؟",
    "بیشترین چیزی که ازش می‌ترسی چیه؟",
    "یک ویژگی که در خودت دوست نداری رو بگو.",
    "یک راز که هیچ‌کس نمی‌دونه رو بگو.",
    "چند بار از کسی درخواست کمک کردی ولی ازش خواسته‌ای رو دریافت نکردی؟",
    "آخرین باری که به کسی دروغ گفتی چه زمانی بود؟",
    "چه چیزی باعث می‌شود احساس شرمندگی کنی؟",
    "بیشترین چیزی که ازش پشیمونی چیه؟",
    "یک شجاعت که اخیراً نشان دادی رو بگو.",
    "یک اشتباه بزرگ که در زندگیت کردی رو بگو.",
    "تا به حال چه چیزی از خانواده‌ات پنهان کردی؟",
    "آخرین باری که عاشق شدی کی بود؟",
    "تا به حال به کسی خیانت کرده‌ای؟",
    "آیا تا به حال دروغ‌های بزرگی گفتی؟",
    "یک ویژگی اخلاقی که هیچ‌وقت تغییر نخواهد کرد رو بگو.",
    "اگر برای یک روز به شخص دیگری تبدیل بشی، چه کسی رو انتخاب می‌کنی؟",
    "آیا تا به حال با کسی دعوا کرده‌ای؟",
    "بهترین خاطره‌ات از دوران کودکی چی بوده؟",
    "چه چیزی در زندگی‌ات می‌خواهی تغییر کنی؟",
    "اگر با شخصی اشتباهی صحبت کردی، چه چیزی رو بهش خواهی گفت؟",
    "آیا تا به حال راز کسی رو لو دادی؟",
    "بهترین چیزی که در حال حاضر داری چی هست؟",
    "آیا تا به حال کسی رو به خاطر احساسات خودت آزردی؟",
    "اگر بتوانی یک چیز رو از زندگی‌ات حذف کنی، چه چیزی خواهد بود؟",
    "در چه شرایطی خودت رو بیشتر ناراحت می‌کنی؟",
    "چند وقت پیش آخرین بار به دوستانت دروغ گفتی؟",
    "آیا تا به حال دروغی گفته‌ای که باعث ناراحتی کسی بشه؟",
    "اگر امروز آخرین روز زندگی‌ات بود، چی کار می‌کردی؟",
    "چه چیزی در زندگی‌ات برات مهم‌ترین چیز هست؟",
    "آیا تا به حال کسی رو که دوستش داشتی از دست دادی؟",
    "بیشترین چیزی که همیشه به دست آوردنش رو می‌خوای چی هست؟",
    "آیا تا به حال به کسی پنهانی کمک کردی؟",
    "بزرگ‌ترین ترس تو در زندگی چی هست؟",
    "اگر به گذشته برمی‌گشتی، چه کاری را انجام نمی‌دادی؟",
    "چطور می‌توانی با شکست‌های زندگی کنار بیایی؟",
    "آیا تا به حال در یک موقعیت شرم‌آور قرار گرفته‌ای؟",
    "اگر یک روز به کسی بخواهی بگویی که دوستش داری، چه می‌گویی؟",
    "چطور می‌توانی احساساتت را بهتر کنترل کنی؟",
    "آیا تا به حال احساس کرده‌ای که به اندازه کافی مورد محبت قرار نگرفته‌ای؟",
    "آخرین باری که کسی به تو محبت کرد، چه زمانی بود؟",
    "اگر قرار باشد از یک عادت بد خود دست برداری، چه عادت‌هایی را انتخاب می‌کنی؟",
    "آیا تا به حال کسی را با ظاهر خود فریب داده‌ای؟",
    "یک ویژگی از خودت که می‌خواهی تغییر کنی رو بگو.",
    "آیا تا به حال فریب خوردی؟",
    "اگر امروز همه چیز تمام می‌شد، چه چیزی از زندگیت باقی می‌موند؟",
    "آیا تا به حال از دست کسی یا چیزی پشیمان شده‌ای؟",
    "چه چیزی باعث شده بیشتر از خودت راضی باشی؟",
    "آیا تا به حال راز شخص دیگری را افشا کرده‌ای؟",
    "آیا تجربه‌ای داری که از آن درس گرفتی؟",
    "آیا چیزی هست که هنوز نتوانستی به دست بیاوری؟",
    "تابحال عاشق شدی ؟",
    "تابحال به عشقت فکر کردی ؟",
    "ایا بسیجی هستی یانه ؟",
    "ایا ساندیس خوری ؟"
]

# لیست سوالات جرأت (60 سوال)
joraat = [
    "یک آواز بخوان و فیلمش رو بفرست.",
    "با چشمان بسته یک تیکه از خوراکی مورد علاقه‌ات رو بخور.",
    "برای 1 دقیقه فقط با یک دست کار کن.",
    "یک حرکت رقص انجام بده و فیلمش رو بفرست.",
    "یک عکس عجیب از خودت بگیر و برای دوستانت بفرست.",
    "از کسی که نزدیکت هست یک compliment (تعریف) بگیر.",
    "با صدای بلند بخند و به مدت 30 ثانیه همینطور بخند.",
    "یک تکه خوراکی رو بدون دست خوردن، فقط با دهن بگیر.",
    "از کسی که نزدیکت هست یک تعریف شنیدی، اون رو برای همه بگو.",
    "یک داستان از خودت بساز که هیچ‌کس باور نکنه.",
    "یک حالت عجیب به صورتت بده و 30 ثانیه همونطور بمون.",
    "از کسی بخواه که یک شعر از حافظ رو بهت بگه.",
    "یک چیز جالب از خودت بگو که کمتر کسی می‌دونه.",
    "با کسی که نزدیکت هست شروع به صحبت کردن ولی فقط کلمات عجیب استفاده کن.",
    "یک عکسی از خودت با لباس عجیب بگیر و ارسال کن.",
    "یک اسنپ از یک کار خنده‌دار انجام بده و ارسال کن.",
    "یک تکه خوراکی رو فقط با دهن بگیر و بدون دست بخور.",
    "در یک فیلم محبوب از خودت بازی کن و آن را برای دوستانت ارسال کن.",
    "یک بار دیگر آواز بخوان ولی این بار به زبان دیگری.",
    "از کسی که نزدیکت هست یک هدیه کوچک بگیر و به کسی که دوستش داری بده.",
    "یک حرکت ورزشی انجام بده و فیلمش رو بفرست.",
    "یک چیز جالب که توی خانه داری را نشان بده.",
    "یک داستان عجيب بساز كه هيچ‌كس باور نكنه.",
    "یک سلفی بگیر ولی این بار صورتت رو بپوشون.",
    "از کسی که نزدیکت هست یک سوال عجیب بپرس و جوابش رو بگو.",
    "چند ثانیه فقط با زبان خود حرف بزن و ویدیو بفرست.",
    "یک چیزی را از اتاق دیگر بیاور و با دست راستت به من نشان بده.",
    "سعی کن چند کلمه به زبان بیگانه بگویی و فیلمش رو بفرست.",
    "یک شعر از خودت بساز و برای دوستانت بفرست.",
    "در یک محیط عمومی یا جمع فیلمی از خودت بگیر.",
    "با حالت عجیب در جلوی دوربین وایسا و از کسی که در کنارته بخواه که فیلمش رو بفرسته.",
    "یک چیز از شخص دیگری بپرس که هیچ‌کس ندونه جوابش چیه.",
    "یک دقیقه بدون هیچ کلمه‌ای در اتاق بایست.",
    "یک حرکت عجیب با دست‌هایت انجام بده.",
    "یک جمله کوتاه برای خودت بگو که هیچ‌کس باور نکند.",
    "یک دقیقه از خودت حرف نزن و فقط دست‌هایت رو حرکت بده.",
    "یک جوک خیلی عجیب تعریف کن.",
    "یک چیزی را از خودت بپوشان که هیچ‌کس انتظار نداشته باشد.",
    "یک حرکت ورزشی سخت انجام بده و فیلمش رو بفرست.",
    "یک خاطره غیر معمول از خودت بگو.",
    "یک عکس خنده‌دار از خودت بگیر و برای دیگران بفرست.",
    "به مدت یک دقیقه با کسی که در کنارت است تماس تصویری برقرار کن.",
    "یک شوخی بداهه انجام بده.",
    "به عشقت بگو ازت حالم بهم میخوره",
    "برو پرچم اسراییل ر ااتش بزن وعکس بده ",
]




# لیست مکان‌های دیدنی شهرهای مختلف ایران
tourist_spots = {
    'تهران': [
        'ارگ تهران', 'کاخ گلستان', 'موزه ایران باستان', 'برج میلاد', 'کاخ سعدآباد',
        'موزه نگارستان', 'موزه فرش', 'پل طبیعت', 'مسجد جامع تهران', 'کاخ نیاوران',
        'میدان امام حسین', 'موزه علم و صنعت', 'میدان آزادی', 'تکیه دولت', 'موزه هنرهای معاصر',
        'آرامگاه فردوسی', 'موزه ملی تاریخ طبیعی', 'موزه بانک ملی ایران', 'قلعه ورجان'
    ],
    'اصفهان': [
        'سی و سه پل', 'مسجد امام اصفهان', 'کاخ عالی قاپو', 'مسجد شیخ لطف الله', 'عمارت چهلستون',
        'موزه تاریخ طبیعی اصفهان', 'میدان نقش جهان', 'برج کبوترخانه', 'حمام علی قلی آقا', 'پل خواجو',
        'موزه هنرهای معاصر', 'میدان امام حسین', 'خانه تاریخی علی‌قلی‌خان', 'مسجد جامع اصفهان',
        'موزه هنرهای اسلامی'
    ],
    'مشهد': [
        'حرم امام رضا (ع)', 'مسجد گوهرشاد', 'حرم حضرت معصومه', 'موزه آستان قدس', 'امامزاده یحیی بن زید',
        'حرم امام محمد باقر', 'حرم امام علی بن موسی الرضا', 'مسجد حاج آقا', 'پارک کوهسنگی',
        'دریاچه مصنوعی پارک ملت', 'پارک آبی سپاد', 'پارک بزرگ وکیل‌آباد', 'مجموعه تفریحی سپاد',
        'پارک بازی پارک ملت', 'کوه سنگی', 'پارک جنگلی وکیل آباد', 'دریاچه کوهسنگی','مسجد ۷۲ تن تاریخی','کلیسای مسروپ مقدس',
        'مقبره خواجه ربیع','گنبد خشتی','آرامگاه خواجه مراد','مدرسه میرزا جعفر','غار مغان'
    ],
    'شیراز': [
        'حافظیه', 'ارگ کریمخان', 'کاخ قوام', 'مسجد وکیل', 'مجموعه پاسارگاد', 'تخت جمشید',
        'دروازه قرآن', 'موزه شهر شیراز', 'حمام وکیل', 'مسجد جامع عتیق', 'مجموعه زندیه',
        'حرم شاهچراغ', 'مسجد وکیل', 'باغ نارنجستان قوام',' باغ عفیف‌آباد', 'باغ ارم', 'پارک دلگشا',
        'باغ‌های شیراز', 'آبشارهای منطقه', 'دریاچه‌ها و دمنوش‌های طبیعی',
    ],
    'تبریز': [
        'موزه آذربایجان', 'بازار تبریز', 'مسجد کبود', 'ارگ تبریز', 'عمارت تاریخی', 'عمارت ایوان‌خانه',
        'خانه کاظمی', 'موزه نظامی', 'مسجد جامع تبریز', 'امامزاده داوود', 'پارک ایل گلی',
        'پارک شیرین', 'پارک کوهستان', 'کوه عینالی', 'دریاچه ارومیه', 'دمنوش‌ها و چشمه‌های طبیعی'
    ],
    'رشت': [
        'موزه رشت', 'عمارت آجری', 'کاخ موزه رشت', 'موزه مردم‌شناسی', 'خانه تاریخی استاد شجریان',
        'مسجد جامع رشت', 'امامزاده ابراهیم', 'پارک سبزه میدان', 'پارک جنگلی میرزا کوچک خان',
        'کوه دالانپر', 'سواحل دریای خزر', 'رودخانه‌ها و چشمه‌ها'
    ],
    'اردبیل': [
        'دریاچه شورابیل', 'پل معلق اردبیل', 'آرامگاه شیخ صفی الدین اردبیلی', 'موزه مردم‌شناسی اردبیل', 
        'حمام قدیمی اردبیل', 'بازار اردبیل', 'رودخانه قره سو', 'پارک ملی سبلان', 'چشمه‌های آب گرم اردبیل',
        'مجموعه تاریخی بیله سوار', 'موزه هنرهای زیبای اردبیل'
    ],
    'مازندران': [
        'سد امیرکلا', 'دریاچه ولشت', 'جنگل دالخانی', 'آبشارهای نیاگارا', 'پناهگاه حیات وحش دشت‌ناز', 
        'پارک جنگلی نور', 'آرامگاه نیکوکار', 'شهر چمستان', 'رودخانه تلار', 'روستای چشمه‌زار', 
        'مجموعه کاخ‌ساری', 'جنگل‌های تنکابن', 'دهکده ساحلی فریدونکنار'
    ],
    'خوزستان (خرم‌شهر)': [
        'نهر کارون', 'موزه جنگ خرمشهر', 'آرامگاه شهید چمران', 'مسجد جامع خرمشهر', 
        'پارک ملت خرمشهر', 'پلیس راه خرمشهر', 'مرکز تجاری دزفول', 'آبشار بختیاری', 
        'تپه‌نوشان', 'پارک ساحلی'
    ],
    'کیش': [
        'ساحل مرجان', 'پارک دلفین‌های کیش', 'جزیره هندورابی', 'کشتی یونانی', 'ساحل سیمرغ', 
        'بازار پردیس', 'مجموعه تفریحی کیش', 'مرکز خرید مروارید', 'پارک ساحلی کیش', 'دلفیناریوم کیش',
        'اسکله تفریحی کیش', 'بازار سنتی کیش'
    ],
    
    'اصفهان': [
    'سی و سه پل', 'مسجد امام اصفهان', 'کاخ عالی قاپو', 'مسجد شیخ لطف الله', 'عمارت چهلستون',
    'موزه تاریخ طبیعی اصفهان', 'میدان نقش جهان', 'برج کبوترخانه', 'حمام علی قلی آقا', 'پل خواجو',
    'موزه هنرهای معاصر', 'میدان امام حسین', 'خانه تاریخی علی‌قلی‌خان', 'مسجد جامع اصفهان',
    'موزه هنرهای اسلامی', 'آرامگاه خواجوی کرمانی', 'عمارت هشت بهشت', 'آبشارهای صحرای شیراز',
    'پارک کوهستانی جلفا', 'جلفا', 'مجموعه تفریحی تله‌کابین', 'بازار قیصریه', 'حمام رستم',
],
    'همدان': [
    'گنبد علویان', 'تپه هگمتانه', 'حمام قلعه', 'آرامگاه باباطاهر', 'آرامگاه ابوعلی سینا',
    'میدان امام خمینی', 'موزه تاریخ طبیعی همدان', 'کوه الوند', 'دریاچه سد اکباتان', 'پارک ملت',
    'خانه تاریخ‌نگاری همدان', 'موزه مردم‌شناسی همدان', 'مجموعه‌ی تاریخی بیستون', 'غار علیصدر',
    'قلعه هگمتانه', 'موزه آرمگاه ابوالمعالی', 'مسجد جامع همدان', 'بازی‌های طبیعی منطقه',
    'مجموعه حمام قاضی', 'آبشار هفت چشمه', 'منطقه گردشگری گنجنامه', 'غار اشتران', 'دره حرم‌سرا',
    'منطقه حفاظت‌شده کوه‌های الوند', 'چشمه علی', 'پارک جنگلی عباس‌آباد', 'مجموعه‌ی تاریخی جواهرآباد',
    'آبشار پیرترین', 'مجموعه اقامتی سیتادل', 'مجموعه‌ی باستان‌شناسی لالجین', 'موزه فرهنگی همدان',
    'رودخانه گاماسیاب', 'کلیسای همدان', 'منطقه تفریحی گنج‌نامه', 'یخچال‌های همدان', 'جاده همدان-کبودرآهنگ'
],
    'قم': [
    'حرم حضرت معصومه (س)', 'مسجد جمکران', 'موزه آستان قدس حضرت معصومه', 'آرامگاه آیت‌الله بروجردی',
    'مکتب‌خانه حضرت معصومه', 'بازار قم', 'مجموعه فاطمیه', 'موزه مردم‌شناسی قم', 'چشمه علی',
    'میدان آستانه', 'پارک جنگلی سرخ‌کوه', 'مجموعه کوهسنگی', 'پارک الغدیر', 'کوه‌های بی‌بی‌شهربانو',
    'مسجد امام حسن عسگری', 'آرامگاه شیخ مفید', 'حرم حضرت علی بن جعفر', 'میدان امام حسین',
    'مرکز علمی تحقیقاتی فقه و اصول', 'کوه‌های آراک', 'حمام تاریخی قم', 'پارک پردیسان', 'آبشارهای قم',
    'آب انبارهای تاریخی قم', 'موزه علم و فن‌آوری قم', 'دریاچه قم', 'موزه‌ کتابخانه آستان قدس',
    'مسجد قمر بنی‌هاشم', 'آرامگاه سیده معصوم', 'محله بازارچه قم', 'مجموعه علمیه قم', 'مسجد حضرت علی',
    'برج علامه طباطبایی', 'چشمه قمر', 'حمام کاشان', 'پارک مادر قم', 'پارک روستای حسن‌آباد',
    'مجموعه گردشگری جبل‌العلوی', 'مجموعه فرهنگی مذهبی حرم حضرت معصومه', 'موزه گرافیک قم', 'محوطه تاریخی قم',
    'موزه هنرهای اسلامی قم', 'یخچال تاریخی قم', 'مرکز فرهنگی مذهبی ولیعصر', 'مکتب‌خانه‌های تاریخی قم',
    'چشمه های تیزاب', 'مسجد جامع قم', 'کلیسای حضرت سلیمان', 'بازار آرد قم', 'مجموعه کتابخانه‌های عمومی قم'
],
    
    'نیشابور': [
    'آرامگاه خیام', 'آرامگاه عطار نیشابوری', 'مسجد جامع نیشابور', 'بازار تاریخی نیشابور', 
    'دهکده چوبی', 'شهر کهن شادیاخ', 'آرامگاه کمال‌الملک', 'باغ ملی نیشابور', 'غار سرنی', 
    'چشمه‌ آب گرم آهنگ', 'دریاچه سد بار', 'منطقه حفاظت شده بینالود', 'آبشار بار', 'روستای بوژان', 
    'مسجد چوبی', 'کاروانسرای عباسی قدمگاه', 'موزه نیشابور', 'پارک شهدای گمنام', 
    'آرامگاه فضل بن شاذان', 'منطقه ریوند', 'قله بینالود', 'موزه خیام', 'محوطه باستانی شادیاخ',
    'باغ امین اسلامی', 'چشمه علی', 'کاروانسرای تاریخی رباط شاه عباسی', 'حمام قدیمی نیشابور',
    'رصدخانه خیام', 'خانه تاریخی معین‌الکتاب', 'روستای برف ریز', 'مجموعه گردشگری ششتمد', 
    'موزه زمین‌شناسی نیشابور', 'چشمه گراب', 'منطقه خوش آب و هوای قدمگاه', 'آرامگاه شیخ حسن جوری',
    'قلعه لک لک', 'کوهستان بوژان', 'کاروانسرای شاه‌عباسی نیشابور', 'خانه باغ صادقی نیشابور',
    'تپه‌های باستانی ریوند', 'چشمه‌های دهنه', 'دریاچه سد قدمگاه', 'منطقه گردشگری زبرخان', 
    'مزار بی‌بی شطیطه', 'خانه تاریخی افتخارالاسلام', 'روستای دیزباد', 'گنبد سبز', 
    'مسجد جامع قدمگاه', 'آبشار گرینه', 'پارک ملت نیشابور', 'منطقه نمونه گردشگری بوژان', 
    'چشمه آب قنات', 'روستای حصار', 'آرامگاه حکیم نیشابوری', 'بازار قدیمی سرای مشهدی', 
    'کویرهای نیشابور', 'موزه سنگ‌های قیمتی', 'کاروانسرای رباط نیشابور', 'باغ آرامگاه کمال‌الملک',
    'کوه‌های قدمگاه', 'کوره‌های آجرپزی قدیمی نیشابور', 'قلعه علی‌آباد', 'پارک کوهستانی بینالود'
],
    'بجنورد': [
    'باغ ملی بجنورد', 'پارک بش‌قارداش', 'عمارت مفخم', 'آیینه‌خانه مفخم', 'آرامگاه شیخ آذری', 
    'منطقه حفاظت‌شده سالوک', 'پارک باباامان', 'دره بازخانه', 'چشمه بش قارداش', 'روستای اسفیدان', 
    'قلعه جاجرمی', 'چشمه آبگرم ایوب', 'مسجد جامع چهار برج', 'منطقه گردشگری گلیل', 'سد شیرین دره', 
    'بازار قدیمی بجنورد', 'غار سوله‌دوک', 'کاروانسرای صفوی قاسم‌آباد', 'روستای درکش', 
    'پارک شهربازی بجنورد', 'موزه مردم‌شناسی بجنورد', 'روستای دهنه اجاق', 'رودخانه اترک', 
    'خانه بانک شاهی بجنورد', 'تپه باستانی ارگ نادری', 'محوطه باستانی اسپیدان', 
    'روستای زوارم', 'غار پلنگان', 'امامزاده سلطان سید عباس', 'روستای توریستی باغلق', 
    'منطقه گردشگری بدرانلو', 'غار گنج‌کوه', 'روستای دشت', 'کوه‌پایه‌های آلاداغ', 
    'محوطه تاریخی چل‌تپه', 'منطقه حفاظت‌شده گلول و سرانی', 'کوشک باغ علوی', 
    'روستای کلاته‌قلی', 'چشمه‌های آب معدنی گرماب', 'رصدخانه باباامان', 'روستای دویدوخ', 
    'تفرجگاه بیدواز', 'قلعه جلال‌الدین', 'تالاب آلماگل', 'خانه‌های پلکانی اسفیدان', 
    'دره زیبا و کوهستانی لوجلی', 'چشمه هینورد', 'موزه خط و کتابت بجنورد', 
    'بازارچه صنایع‌دستی بجنورد', 'قلعه فورگ', 'محوطه تاریخی ارگ دره‌گاز', 
    'غارهای کوهستانی بجنورد', 'آبشار حسرت‌آباد', 'روستای قورچای', 'سد خاکی شیرین‌دره', 
    'آبگرم قلی‌دره', 'پارک تفریحی شهید چمران', 'دریاچه طبیعی باباامان'
],
    
    'اهواز': [
    'پل سفید اهواز', 'پل سیاه', 'رودخانه کارون', 'جزیره‌ی تفریحی کارون', 'بازار عبدالحمید', 
    'بازار کاوه', 'پارک جزیره', 'پارک لاله', 'خانه تاریخی ماپار', 'پل طبیعت کیانپارس', 
    'پارک ساحلی اهواز', 'مسجد جامع اهواز', 'موزه هنرهای معاصر اهواز', 'کلیسای سورپ گئورگ', 
    'کاروانسرای معین‌التجار', 'تالاب شادگان', 'زیگورات چغازنبیل', 'روستای پامنار', 
    'کاخ آپادانا شوش', 'آرامگاه دانیال نبی', 'هفت‌تپه', 'پارک شهروند', 'بوستان شهرک نفت', 
    'آبشار مصنوعی پل طبیعت', 'پارک آبی اهواز', 'دهکده ساحلی اهواز', 'پل کابلی اهواز', 
    'بازار سنتی امام رضا', 'خانه عین‌الدوله', 'کاخ خزعل', 'تالاب بامدژ', 'بازار مرکزی کیانپارس', 
    'مرکز خرید زیتون', 'رستوران‌های سنتی کنار کارون', 'روستای مال‌میر', 'رودخانه دز', 
    'بندر شادگان', 'موزه ملی خوزستان', 'پارک جنگلی ساحلی اهواز', 'آبشارهای میان‌تنگان', 
    'دریاچه سد دز', 'خانه مستوفی', 'محله عامری', 'بندر ماهشهر', 'پارک خانواده', 
    'دژ شوشتر', 'نقوش برجسته ایذه', 'کارون‌گردی شبانه', 'پل هلالی اهواز', 'بند خاکی بالارود', 
    'سد کرخه', 'پل تاریخی اندیمشک', 'زیارتگاه علی ابن مهزیار اهوازی', 'مسجد رنگونی‌ها', 
    'بازار بزرگ اهواز', 'سواحل زیبای کارون', 'خیابان لشکرآباد (غذاهای محلی)', 'جزیره ام‌الدبس', 
    'معبد ایلامی‌ها در شوشتر', 'کانال داریون', 'محوطه باستانی هفت‌تپه', 'کلیسای گاراپت', 
    'آبشارهای شوشتر (سازه‌های آبی شوشتر)', 'مرکز خرید سیتی‌سنتر مهزیار', 'پارک ملی دز', 
    'تالاب میانگران ایذه', 'پایانه کشتی‌رانی اهواز', 'بازارچه صنایع‌دستی اهواز', 
    'موزه نفت اهواز', 'موزه جنگ خوزستان', 'سد گتوند'
],
    
     'کرمان': [
        'ارگ بم', 'باغ شاهزاده ماهان', 'گنبد جبلیه', 'بازار بزرگ کرمان', 'حمام گنجعلی‌خان', 
        'موزه زرتشتیان', 'میدان گنجعلی‌خان', 'مسجد ملک', 'مسجد جامع کرمان', 'قلعه اردشیر', 
        'باغ فتح‌آباد', 'پارک ملی خبر', 'غار ایوب', 'دهکده شفیع‌آباد', 'روستای میمند', 
        'چشمه‌های آبگرم لاله‌زار', 'کوه هزار', 'یخدان مؤیدی', 'کلوت‌های شهداد', 
        'دشت لوت', 'روستای سیرچ', 'کویر شهداد', 'بافت تاریخی کرمان', 'مسجد پامنار',
        'ارگ راین', 'پارک جنگلی پردیسان', 'منطقه گردشگری هنزا', 'حمام وکیل'
    ],
    'کرمانشاه': [
        'طاق بستان', 'بیستون', 'غار قوری قلعه', 'بازار سنتی کرمانشاه', 'تکیه معاون‌الملک', 
        'تکیه بیگلربیگی', 'مسجد شافعی', 'سراب نیلوفر', 'باغ گل‌ها', 'پل کهنه', 
        'کاروانسرای عباسی بیستون', 'معبد آناهیتا', 'سراب روانسر', 'پارک کوهستان', 
        'طاق گرا', 'بازار توپخانه', 'کلیسای قلب مقدس', 'محوطه تاریخی دینور', 'سراب صحنه',
        'آبشار پیران', 'روستای اورامان تخت', 'پارک جنگلی چغاگاوره', 'دریاچه مصنوعی دشت'
    ],
    'ایلام': [
        'قلعه والی', 'دریاچه دوقلوی سیاه گاو', 'آبشار اما', 'منطقه تفریحی تنگه کافرین', 
        'غار زینه‌گان', 'تنگ رازیانه', 'کبیرکوه', 'منطقه تفریحی مانشت', 'امامزاده علی صالح', 
        'مجموعه تاریخی سیروان', 'پارک جنگلی چغاسبز', 'چشمه‌های آب گرم ایلام', 'قلعه اسماعیل‌خان', 
        'منطقه حفاظت شده کولگ', 'روستای کلم', 'سراب کلان', 'منطقه تفریحی مله‌پیشانی', 
        'تالاب چنگوله', 'غار طلسم ایلام', 'مسجد والی'
    ],
    'بروجرد': [
        'میدان امام حسین', 'مسجد جامع بروجرد', 'آرامگاه امامزاده محمد', 'خانه تاریخی جندی', 
        'حمام تاریخی بروجرد', 'عمارت شاپوری', 'گنبد علویان', 'موزه بروجرد', 'چشمه‌های آب گرم بروجرد',
        'پارک جنگلی بروجرد', 'دریاچه مصنوعی بروجرد', 'خانه تاریخی کاظمی', 'بازار قدیمی بروجرد',
        'کوه میشم', 'منطقه گردشگری تنگه دالان', 'روستای دره‌گز', 'قلعه ساسانی بروجرد', 'آبشار آب‌مروارید'
    ],
    
    'گلستان':
        [
    'پارک ملی گلستان', 'جنگل ناهارخوران', 'آبشار کبودوال', 'برج قابوس', 'تالاب گمیشان', 
    'جزیره آشوراده', 'پارک جنگلی قرق', 'آبشار شیرآباد', 'روستای زیارت', 'غار کیارام', 
    'موزه گنبد کاووس', 'بازار نعلبندان گرگان', 'مدرسه عمادیه', 'سد وشمگیر', 'دیوار بزرگ گرگان',
    'امامزاده نور گرگان', 'آبشار لوه', 'جنگل توسکستان', 'خانه تاریخی تقوی‌ها', 'دریاچه توشن',
    'روستای جهان‌نما', 'مجموعه آبشارهای دره زرین گل', 'بازارچه مرزی اینچه‌برون'
],
        
    
    

    





}

# لیست عبارات مشهدی
meshedi_phrases = {
    "لیست مشهد": [
        ("اِشکاف", "کمد / تاقچه"),
        ("جارو", "تی کشیدن"),
        ("کله پاچه", "کِلاپا"),
        ("پیش دستی", "لاچین"),
        ("موقع", "مواقِع"),
        ("آب خور", "تِره"),
        ("شکم", "تومه"),
        ("نگاه کن", "زیارت کن"),
        ("دم در", "دَر گَواب"),
        ("فرار کردن", "دورو رفتن"),
        ("سیب", "یابو"),
        ("آغل چغک", "لانهٔ گنجشک"),
        ("آق میرزا", "شوهر خواهر"),
        ("اَلِفش، چسبو", "نوچ، چسبناکی در اثر شیرینی"),
        ("اُه یَره", "آهای آقا!"),
        ("اُوشتولی", "مال مفت، مجانی"),
        ("بزغله مار", "بزمجه"),
        ("بٌزٌنقره", "جوجه تیغی"),
        ("بِـکَّـن (یره بِـکَّـن دِگِه)", "بیش از این سر به سر من نگذار، بیخیال شو، اعصاب مرا خرد نکن"),
        ("بیساژ", "یک حالت از بازی با لانکا که آنرا با بغل پا بطور مکرر (مانند روپائی ولی با بغل پا) انجام می‌دادند بطوریکه پائی که با لانکا بازی می‌کرد نباید با زمین برخورد می‌کرد."),
        ("پاک کن", "مدادپاک کن"),
        ("پت", "پشم. موی فرفری. موی زائد"),
        ("پِلَخ", "عمل نشان دادن انگشت شصت به منظور منفی (حرکت بسیار بی ادبانه)"),
        ("پِلَخمون", "فلاخن، قلاب‌سنگ"),
        ("پِندِری", "گمان می‌کنی"),
        ("پوز", "دهان"),
        ("توشله", "تیله"),
        ("جُل جُل، جُل خوردن", "تکان خوردن خفیف"),
        ("جوری", "ذرت"),
        ("جوز", "گردو"),
        ("چُخد، چُخت", "سقف"),
        ("چُرنه", "لوله خروجی قوری و کتری"),
        ("چُغُک", "گنجشک"),
        ("چُل", "آلت جنسی پسر بچه‌ها (دول یا دودول)"),
        ("چوری", "النگو"),
        ("چوسی", "دستمال کبوتر بازی"),
        ("چُوله غِزَک", "مترسک داخل جالیز"),
        ("چینگ، چنگ", "منقار (در عبارت بسیار توهین‌آمیز «بِبَند چینگته (چینگت را ببند)»، به معنی دهان نیز به کار برده می‌شود)"),
        ("خُردو", "کوچک"),
        ("خُسبیده", "خوابیده"),
        ("خُسور", "پدر زن (پدر شوهر)"),
        ("خِفتی", "گردن‌بند"),
        ("خوش", "مادر زن (مادر شوهر)"),
        ("دادو", "نوزاد"),
        ("دل", "سطل"),
        ("دِلِنگون", "آویزون"),
         ("شور دِدَن (شله‌ها ر شور بده)", "هم زدن (شله‌ها را هم بزن)"),
        ("شور دِدَن (مسئله یا یک مشاجره)", "جلوی حل شدن مسئله را گرفتن، آتش بیار معرکه شدن"),
        ("طاس", "کاسه"),
        ("غُطِّه خوردن", "آب‌تنی کردن (نه الزاماً شنا کردن)"),
        ("فَلَکه", "میدان"),
        ("قبرقه", "دنده"),
        ("قرت", "شورت (قدیما به شلوارک هم گفته می‌شده)"),
        ("قِلِه", "روستا"),
        ("قوه", "باتری"),
        ("کاغذباد", "بادبادک"),
        ("کال", "مسیر عبور آب"),
        ("کچه سگ", "توله سگ"),
        ("کُخ", "سوسک، کرم درون میوه"),
        ("کُخ نریز", "اذیت نکن"),
        ("کرت", "دفعه"),
        ("کَق", "میوه نارس"),
        ("کُلاج", "کسی که چشمش چپ است"),
        ("کِلپسه", "مارمولک"),
        ("کلف زدن", "گاز زدن"),
        ("کِلّه وَنگ", "درگیر شدن"),
        ("کلوخ", "گل خشک شده متراکم، آجر"),
        ("کِیس", "کیک کوچک"),
        ("گرده", "پهلو"),
        ("لاخ (مو)", "تار مو"),
        ("لانکا", "وسیله بازی از سرب و چرم"),
        ("لَتِّه", "تکه پارچه کهنه"),
        ("لُکّه", "مچاله، درهم فرورفته"),
        ("لِمَشت", "کثیف"),
        ("لوخ", "حصیر"),
        ("لوش", "لجن"),
        ("مازولاق", "فرفره چوبی"),
        ("مِس مِس", "معطل کردن"),
        ("مکُش مرگِ ما", "اعیانی، خیلی باکلاس"),
        ("مورچه گازی", "مورچه بیابانی"),
        ("موسی کو تقی", "قمری"),
        ("میلان", "کوچه‌های فرعی روبروی هم"),
        ("ناخون جِله", "نیشگون"),
        ("ناردشور", "ناودان"),
        ("نارنجک", "نان خامه‌ای"),
        ("ناسور", "زدگی، زخمی شدن"),
        ("ناسوس", "تلمبه دوچرخه"),
        ("ناشور", "نشسته"),
        ("هم زلف", "باجناغ"),
        ("همسِده", "همسایه"),
        ("وَخِه", "برخیز، پاشو"),
        ("وَرچُپه", "برعکس"),
        ("یاد دِشتَن", "بلد بودن"),
        ("یَره، یَرٍ‌گِه", "یارو"),
        ("یَقَنی", "یقه سفید مدرسه"),
        # احوال‌پرسی مشهدی
        ("سِلام", "سلام"),
        ("خوبِن؟", "خوب هستید؟")
        # سایر کلمات قبلی اضافه شده به اینجا
    ]
}

# ارسال لیست در چند بخش
async def send_in_chunks(update, text, chunk_size=10):
    # تقسیم متن به چند بخش
    chunks = [text[i:i + chunk_size] for i in range(0, len(text), chunk_size)]
    for chunk in chunks:
        await update.reply(chunk)
        
        


